case/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    engineInlet
    {
        type            calculated;
        value           uniform 0;
    }
    freestreamInlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    internalNozzleWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
38
(
185.024
185.024
185.024
185.024
185.024
185.024
185.024
185.024
...
)
;
    }
    externalNozzleWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
38
(
773.342
773.342
773.342
773.342
773.342
773.342
773.342
773.342
...
)
;
    }
    topSlip
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
