case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O   peration   |                                                 |
|   \\    /   A nd         |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "(U|e|T).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors        1;
    nCorrectors             1;
    nNonOrthogonalCorrectors 0;
}
